## Pandas DataFrame Operations
## 20180725
## Sungjae Lee

In [1]:
import pandas as pd
from pandas import Series
from pandas import DataFrame

import numpy as np

### Series addtion operation

In [3]:
s1 = Series(range(1, 6),
           index = list('abcde'))
s1

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [4]:
s2 = Series(range(5, 11),
           index = list('bcedef'))
s2

b     5
c     6
e     7
d     8
e     9
f    10
dtype: int64

In [5]:
s1.add(s2)

a     NaN
b     7.0
c     9.0
d    12.0
e    12.0
e    14.0
f     NaN
dtype: float64

In [6]:
s1 + s2

a     NaN
b     7.0
c     9.0
d    12.0
e    12.0
e    14.0
f     NaN
dtype: float64

### dataframe opertion

In [7]:
df1 = DataFrame(np.arange(9).reshape(3, 3),
               columns = list('abc'))
df1

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [8]:
df2 = DataFrame(np.arange(16).reshape(4, 4),
               columns = list('abcd'))
df2

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [9]:
df1 + df2

      a     b     c   d
0   0.0   2.0   4.0 NaN
1   7.0   9.0  11.0 NaN
2  14.0  16.0  18.0 NaN
3   NaN   NaN   NaN NaN

In [12]:
df1.add(df2, fill_value = 0)
# fill_value 설정으로 NaN 값을 특정 값으로 지정하여 넣을 수 있음

      a     b     c     d
0   0.0   2.0   4.0   3.0
1   7.0   9.0  11.0   7.0
2  14.0  16.0  18.0  11.0
3  12.0  13.0  14.0  15.0

### operations for dataframe with series

In [13]:
df = DataFrame(np.arange(16).reshape(4, 4),
              columns = list('abcd'))
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [14]:
s = Series(range(10, 14), index = list('abcd'))
s

a    10
b    11
c    12
d    13
dtype: int64

In [15]:
df + s

    a   b   c   d
0  10  12  14  16
1  14  16  18  20
2  18  20  22  24
3  22  24  26  28

In [16]:
s2 = Series(np.arange(10, 14))
s2

0    10
1    11
2    12
3    13
dtype: int64

In [17]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [19]:
df + s2

    a   b   c   d   0   1   2   3
0 NaN NaN NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN NaN NaN

In [20]:
df.add(s2, axis = 0)

    a   b   c   d
0  10  11  12  13
1  15  16  17  18
2  20  21  22  23
3  25  26  27  28